MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK40DN512VMC10/mcu.h
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections. The user can configure the
 * hardware request into DMAMUX to trigger the DMA transfer accordingly. The index
 * of the hardware request varies according  to the to SoC.
 */
typedef enum _dma_request_source
{
    kDmaRequestMux0Disable          = 0|0x100U,    /**< Disable */
    kDmaRequestMux0Reserved1        = 1|0x100U,    /**< Reserved1 */
    kDmaRequestMux0UART0Rx          = 2|0x100U,    /**< UART0 receive complete */
    kDmaRequestMux0UART0Tx          = 3|0x100U,    /**< UART0 transmit complete */
    kDmaRequestMux0UART1Rx          = 4|0x100U,    /**< UART1 receive complete */
    kDmaRequestMux0UART1Tx          = 5|0x100U,    /**< UART1 transmit complete */
    kDmaRequestMux0UART2Rx          = 6|0x100U,    /**< UART2 receive complete */
    kDmaRequestMux0UART2Tx          = 7|0x100U,    /**< UART2 transmit complete */
    kDmaRequestMux0UART3Rx          = 8|0x100U,    /**< UART3 receive complete */
    kDmaRequestMux0UART3Tx          = 9|0x100U,    /**< UART3 transmit complete */
    kDmaRequestMux0UART4Rx          = 10|0x100U,   /**< UART4 receive complete */
    kDmaRequestMux0UART4Tx          = 11|0x100U,   /**< UART4 transmit complete */
    kDmaRequestMux0UART5Rx          = 12|0x100U,   /**< UART5 receive complete */
    kDmaRequestMux0UART5Tx          = 13|0x100U,   /**< UART5 transmit complete */
    kDmaRequestMux0I2S0Rx           = 14|0x100U,   /**< I2S0 receive complete */
    kDmaRequestMux0I2S0Tx           = 15|0x100U,   /**< I2S0 transmit complete */
    kDmaRequestMux0SPI0Rx           = 16|0x100U,   /**< SPI0 receive complete */
    kDmaRequestMux0SPI0Tx           = 17|0x100U,   /**< SPI0 transmit complete */
    kDmaRequestMux0SPI1Rx           = 18|0x100U,   /**< SPI1 receive complete */
    kDmaRequestMux0SPI1Tx           = 19|0x100U,   /**< SPI1 transmit complete */
    kDmaRequestMux0SPI2Rx           = 20|0x100U,   /**< SPI2 receive complete */
    kDmaRequestMux0SPI2Tx           = 21|0x100U,   /**< SPI2 transmit complete */
    kDmaRequestMux0I2C0             = 22|0x100U,   /**< I2C0 transmission complete */
    kDmaRequestMux0I2C1             = 23|0x100U,   /**< I2C1 transmission complete */
    kDmaRequestMux0FTM0Channel0     = 24|0x100U,   /**< FTM0 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel1     = 25|0x100U,   /**< FTM0 channel 1 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel2     = 26|0x100U,   /**< FTM0 channel 2 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel3     = 27|0x100U,   /**< FTM0 channel 3 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel4     = 28|0x100U,   /**< FTM0 channel 4 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel5     = 29|0x100U,   /**< FTM0 channel 5 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel6     = 30|0x100U,   /**< FTM0 channel 6 event (CMP or CAP) */
    kDmaRequestMux0FTM0Channel7     = 31|0x100U,   /**< FTM0 channel 7 event (CMP or CAP) */
    kDmaRequestMux0FTM1Channel0     = 32|0x100U,   /**< FTM1 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM1Channel1     = 33|0x100U,   /**< FTM1 channel 1 event (CMP or CAP) */
    kDmaRequestMux0FTM2Channel0     = 34|0x100U,   /**< FTM2 channel 0 event (CMP or CAP) */
    kDmaRequestMux0FTM2Channel1     = 35|0x100U,   /**< FTM2 channel 1 event (CMP or CAP) */
    kDmaRequestMux0Reserved36       = 36|0x100U,   /**< Reserved36 */
    kDmaRequestMux0Reserved37       = 37|0x100U,   /**< Reserved37 */
    kDmaRequestMux0Reserved38       = 38|0x100U,   /**< Reserved38 */
    kDmaRequestMux0Reserved39       = 39|0x100U,   /**< Reserved39 */
    kDmaRequestMux0ADC0             = 40|0x100U,   /**< ADC0 conversion complete */
    kDmaRequestMux0ADC1             = 41|0x100U,   /**< ADC1 conversion complete */
    kDmaRequestMux0CMP0             = 42|0x100U,   /**< CMP0 Output */
    kDmaRequestMux0CMP1             = 43|0x100U,   /**< CMP1 Output */
    kDmaRequestMux0CMP2             = 44|0x100U,   /**< CMP2 Output */
    kDmaRequestMux0DAC0             = 45|0x100U,   /**< DAC0 buffer pointer reaches upper or lower limit */
    kDmaRequestMux0DAC1             = 46|0x100U,   /**< DAC1 buffer pointer reaches upper or lower limit */
    kDmaRequestMux0CMT              = 47|0x100U,   /**< CMT end of modulation cycle event */
    kDmaRequestMux0PDB0             = 48|0x100U,   /**< PDB0 programmable interrupt delay event */
    kDmaRequestMux0PortA            = 49|0x100U,   /**< PORTA rising, falling or both edges */
    kDmaRequestMux0PortB            = 50|0x100U,   /**< PORTB rising, falling or both edges */
    kDmaRequestMux0PortC            = 51|0x100U,   /**< PORTC rising, falling or both edges */
    kDmaRequestMux0PortD            = 52|0x100U,   /**< PORTD rising, falling or both edges */
    kDmaRequestMux0PortE            = 53|0x100U,   /**< PORTE rising, falling or both edges */
    kDmaRequestMux0AlwaysOn54       = 54|0x100U,   /**< Always enabled 54 */
    kDmaRequestMux0AlwaysOn55       = 55|0x100U,   /**< Always enabled 55 */
    kDmaRequestMux0AlwaysOn56       = 56|0x100U,   /**< Always enabled 56 */
    kDmaRequestMux0AlwaysOn57       = 57|0x100U,   /**< Always enabled 57 */
    kDmaRequestMux0AlwaysOn58       = 58|0x100U,   /**< Always enabled 58 */
    kDmaRequestMux0AlwaysOn59       = 59|0x100U,   /**< Always enabled 59 */
    kDmaRequestMux0AlwaysOn60       = 60|0x100U,   /**< Always enabled 60 */
    kDmaRequestMux0AlwaysOn61       = 61|0x100U,   /**< Always enabled 61 */
    kDmaRequestMux0AlwaysOn62       = 62|0x100U,   /**< Always enabled 62 */
    kDmaRequestMux0AlwaysOn63       = 63|0x100U,   /**< Always enabled 63 */
} dma_request_source_t;

/* @} */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


